
namespace MorseEncrypt
{
    public class Encrypter
    {
        private char[] _englishletters = { 'A', 'B', 'C',
        'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L',
        'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U',
        'V', 'W', 'X', 'Y', 'Z'};

        private char[] _russianLetters = {'А', 'Б', 'В', 'Г',
        'Д', 'Е', 'Ж', 'З', 'И', 'Й', 'К', 'Л', 'М',
        'Н', 'О', 'П', 'Р', 'С', 'Т', 'У', 'Ф', 'Х',
        'Ц', 'Ч', 'Ш', 'Щ', 'Ъ', 'Ы', 'Ь', 'Э', 'Ю',
        'Я'};

        private char[] _digits = { "1", }

        private string[] _letterCodes = { "*-", "-***", "*--",
        "--*", "-**", "*", "***-", "--**", "**", "*---", "-*-",
        "*-**", "--", "-*", "---", "*--*", "*-*", "***", "-",
        "**-", "**-*", "****", "-*-*", "---*", "----", "--*-",
        "--*--", "-*--", "-**-", "**-**", "**--", "*-*-"};

        public Encrypter()
        {
            
        }
    }
}
